Revit 2026 API

# DisplacementElementIsNotEmpty Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsNotEmpty(
	ICollection<ElementId> elementIds
)
```
```vb
Public Shared Function IsNotEmpty (
	elementIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool IsNotEmpty(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
static member IsNotEmpty :
        elementIds : ICollection<ElementId> -> bool
```

#### Parameters

elementIds ICollectionElementId

#### Return Value

Boolean

#### Reference

DisplacementElement Class

Autodesk.Revit.DB Namespace